cask_args appdir: "/Applications"

tap "heroku/brew"
tap "motemen/ghq"
tap "sanemat/font"

brew "anyenv"
brew "composer"
brew "ghq"
brew "git"
brew "heroku"
brew "jq"
brew "mysql"
brew "peco"
brew "php-code-sniffer"
brew "postgresql"
brew "sqlite"
brew "tmux"
brew "vim"
brew "yarn"
# php 7.4.X library
# ==================
brew "autoconf"
brew "BZip2"
brew "icu4c"
brew "krb5"
brew "libedit"
brew "libiconv"
brew "libjpeg"
brew "libpng"
brew "libxml2"
brew "libzip"
brew "oniguruma"
brew "openssl@1.1"
brew "pkg-config"
brew "tidy-html5"
# ==================
cask "adobe-creative-cloud"
cask "android-studio"
cask "alfred"
cask "chatwork"
cask "cheatsheet"
cask "discord"
cask "docker"
cask "evernote"
cask "figma"
cask "firefox"
cask "gitify"
cask "google-chrome"
cask "google-japanese-ime"
cask "megasync"
cask "mysqlworkbench"
cask "poedit"
cask "postman"
cask "sourcetree"
cask "stoplight-studio"
cask "spectacle"
cask "tableplus"
cask "thunderbird"
cask "visual-studio-code"
cask "zoomus"

mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "OneDrive", id: 823766827
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835