cask_args appdir: "/Applications"

tap "motemen/ghq"
tap "sanemat/font"

brew "anyenv"
brew "asdf"
brew "coreutils"
brew "curl"
brew "ghq"
brew "git"
brew "jq"
brew "mysql"
brew "peco"
brew "sqlite"
brew "tmux"
brew "vim"
brew "yarn"

cask "adobe-creative-cloud"
cask "android-studio"
cask "alfred"
cask "cheatsheet"
cask "discord"
cask "docker"
cask "evernote"
cask "figma"
cask "firefox"
cask "gitify"
cask "google-chrome"
cask "google-japanese-ime"
cask "megasync"
cask "poedit"
cask "postman"
cask "sourcetree"
cask "spotify"
cask "stoplight-studio"
cask "spectacle"
cask "tableplus"
cask "visual-studio-code"
cask "zoomus"

mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "OneDrive", id: 823766827
mas "Microsoft OneNote", id: 784801555
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835